### Yosys taargetting GoWin
#
# yosys cpu_wrapper.ys | tee synthesis.log
#
read_verilog ../../../cpu_wrapper.v
read_verilog ../../../../source/cpu.v
read_verilog ../../../../source/ALU8.v

hierarchy -check -top cpu_wrapper
synth_gowin -top cpu_wrapper -noalu -vout cpu_wrapper.v
stat
