### Yosys taargetting GoWin
# yosys -s fir_pe_wrapper.ys | tee synthesis.log
#

read_verilog ../../../fir_pe_wrapper.v
read_verilog ../../../../../2-9_Lab7_FIR_PE/source/fir_pe.v

hierarchy -check -top fir_pe_wrapper

synth_gowin -top fir_pe_wrapper -vout fir_pe_wrapper.v

write_verilog  fir_pe_wrapper.v
stat
