# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/local/share/qflow/tech/etri050/etri05_stdcells.lib
read_verilog  /home/goodkook/ETRI050_DesignKit/devel/Ref_Design/booth_multiplier/source/booth_multiplier.v
read_verilog  booth_substep.v
read_verilog  eight_bit_adder_subractor.v
read_verilog  fa.v
read_verilog  xor2.v

# High-level synthesis
synth -top booth_multiplier
# Map register flops
dfflibmap -liberty /usr/local/share/qflow/tech/etri050/etri05_stdcells.lib
opt

# Map combinatorial cells, standard script
abc -exe /usr/local/share/qflow/bin/yosys-abc -liberty /usr/local/share/qflow/tech/etri050/etri05_stdcells.lib -script +strash;scorr;ifraig;retime,{D};strash;dch,-f;map,-M,1,{D}
flatten
setundef -zero

clean -purge
# Output buffering
iopadmap -outpad BUFX2 A:Y -bits
# Cleanup
opt
clean
rename -enumerate
write_verilog  booth_multiplier_mapped.v
stat
