### Yosys taargetting GoWin
# yosys -s Your_Design_wrapper.ys | tee synthesis.log
#

read_verilog ../../../Your_Design_wrapper.v
read_verilog -sv ../../../../source/Your_Design.v
read_verilog -sv ../../../../source/pixel_gen.v

hierarchy -check -top Your_Design_wrapper

synth_gowin -top Your_Design_wrapper -vout Your_Design_wrapper.v

write_verilog  Your_Design_wrapper.v

stat
