### Yosys targetting Xilinx
# yosys -s fir8_wrapper.ys | tee synthesis.log
#

read_verilog ../../../fir8_wrapper.v
read_verilog ../../../../../2-5_Lab3_FIR8/rtl_verilog/fir_pe.v
read_verilog -sv ../../../../source/fir8.v

hierarchy -check -top fir8_wrapper

synth_xilinx -top fir8_wrapper -family xc7

write_verilog fir8_wrapper.v
stat

